# Topic 6: Merging, Joining, and Concatenating DataFrames

In [1]:
import numpy as np
import pandas as pd

# Task 1

### merge() is simialr to SQL JOIN which allow merging dataframes based on differnt columns merge can be inner, outer , right , left

### join() allow joining dafaram based on index by default.
### concate() allow concatenating dataframe vertically or horizontally

## Task 2

In [3]:
df1 = pd.DataFrame({
    'EmployeeID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

# Second DataFrame
df2 = pd.DataFrame({
    'EmployeeID': [1, 2, 4],
    'Department': ['HR', 'IT', 'Finance']
})
print(df1)
print(df2)
pd.merge(df2, df1, how="inner", on="EmployeeID")

   EmployeeID     Name
0           1    Alice
1           2      Bob
2           3  Charlie
   EmployeeID Department
0           1         HR
1           2         IT
2           4    Finance

   EmployeeID Department   Name
0           1         HR  Alice
1           2         IT    Bob

## Task 3

In [4]:
df1 = pd.DataFrame({
    'EmployeeID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

# Second DataFrame
df2 = pd.DataFrame({
    'EmployeeID': [1, 2, 4],
    'Department': ['HR', 'IT', 'Finance']
})
print(df1)
print(df2)
pd.merge(df2, df1, how="inner", on="EmployeeID")

   EmployeeID     Name
0           1    Alice
1           2      Bob
2           3  Charlie
   EmployeeID Department
0           1         HR
1           2         IT
2           4    Finance

   EmployeeID Department   Name
0           1         HR  Alice
1           2         IT    Bob

## Task 4

In [ ]:
df1 = pd.DataFrame({
    'EmployeeID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

# Second DataFrame
df2 = pd.DataFrame({
    'EmployeeID': [1, 2, 4],
    'Department': ['HR', 'IT', 'Finance']
})
print(df1)
print(df2)
pd.merge(df2, df1, how="left", on="EmployeeID")
# it will include all the data form the first dataframe (i.e. df2).

   EmployeeID     Name
0           1    Alice
1           2      Bob
2           3  Charlie
   EmployeeID Department
0           1         HR
1           2         IT
2           4    Finance

   EmployeeID Department   Name
0           1         HR  Alice
1           2         IT    Bob
2           4    Finance    NaN

## Task 5

In [ ]:
df1 = pd.DataFrame({
    'EmployeeID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

# Second DataFrame
df2 = pd.DataFrame({
    'EmployeeID': [1, 2, 4],
    'Department': ['HR', 'IT', 'Finance']
})
print(df1)
print(df2)
pd.merge(df2, df1, how="outer", on="EmployeeID")
# It includes data from both data frame

   EmployeeID     Name
0           1    Alice
1           2      Bob
2           3  Charlie
   EmployeeID Department
0           1         HR
1           2         IT
2           4    Finance

   EmployeeID Department     Name
0           1         HR    Alice
1           2         IT      Bob
2           3        NaN  Charlie
3           4    Finance      NaN

## Task 6

In [8]:
df1 = pd.DataFrame({
    'EmployeeID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

# Second DataFrame
df2 = pd.DataFrame({
    'EmployeeID': [1, 2, 4],
    'Department': ['HR', 'IT', 'Finance']
})
print(df1)
print(df2)

pd.concat([df1, df2], axis=0)

   EmployeeID     Name
0           1    Alice
1           2      Bob
2           3  Charlie
   EmployeeID Department
0           1         HR
1           2         IT
2           4    Finance

   EmployeeID     Name Department
0           1    Alice        NaN
1           2      Bob        NaN
2           3  Charlie        NaN
0           1      NaN         HR
1           2      NaN         IT
2           4      NaN    Finance

## Task 7

In [9]:
df1 = pd.DataFrame({
    'EmployeeID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

# Second DataFrame
df2 = pd.DataFrame({
    'EmployeeID': [1, 2, 4],
    'Department': ['HR', 'IT', 'Finance']
})
print(df1)
print(df2)
pd.concat([df1, df2], axis=1)

   EmployeeID     Name
0           1    Alice
1           2      Bob
2           3  Charlie
   EmployeeID Department
0           1         HR
1           2         IT
2           4    Finance

   EmployeeID     Name  EmployeeID Department
0           1    Alice           1         HR
1           2      Bob           2         IT
2           3  Charlie           4    Finance

## Task 8

In [12]:
df1 = pd.DataFrame({
    'EmpID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

# Second DataFrame with 'EmployeeNumber'
df2 = pd.DataFrame({
    'EmployeeNumber': [1, 2, 4],
    'Department': ['HR', 'IT', 'Finance']
})
pd.merge(df1, df2, left_on="EmpID", right_on="EmployeeNumber", how="inner")

   EmpID   Name  EmployeeNumber Department
0      1  Alice               1         HR
1      2    Bob               2         IT

## TAsk 9

In [15]:
df1 = pd.DataFrame({
    'EmpID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

# Second DataFrame with 'EmployeeNumber'
df2 = pd.DataFrame({
    'EmployeeNumber': [1, 2, 4],
    'Department': ['HR', 'IT', 'Finance']
})
print(df1)
print(df2)
df1.join(df2)

   EmpID     Name
0      1    Alice
1      2      Bob
2      3  Charlie
   EmployeeNumber Department
0               1         HR
1               2         IT
2               4    Finance

   EmpID     Name  EmployeeNumber Department
0      1    Alice               1         HR
1      2      Bob               2         IT
2      3  Charlie               4    Finance

## Task 10

In [18]:
df1 = pd.DataFrame({
    'EmployeeID': [1, 2, 3],
    'Name': ['Alice', np.nan, 'Charlie']  # Bob's name is missing
})

# Second DataFrame with a missing department
df2 = pd.DataFrame({
    'EmployeeID': [1, 2, 4],
    'Department': ['HR', np.nan, 'Finance']  # IT department is missing
})
print(df1)
print(df2)
com_df=pd.merge(df2, df1, how="outer", on="EmployeeID")
# It includes data from both data frame
print(com_df)
com_df.fillna(0)

   EmployeeID     Name
0           1    Alice
1           2      NaN
2           3  Charlie
   EmployeeID Department
0           1         HR
1           2        NaN
2           4    Finance
   EmployeeID Department     Name
0           1         HR    Alice
1           2        NaN      NaN
2           3        NaN  Charlie
3           4    Finance      NaN

   EmployeeID Department     Name
0           1         HR    Alice
1           2          0        0
2           3          0  Charlie
3           4    Finance        0

## Task 11

In [23]:
# First DataFrame
df1 = pd.DataFrame({
    'EmployeeID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

# Second DataFrame
df2 = pd.DataFrame({
    'EmployeeID': [2, 3, 4],
    'Name': ['Bob', 'Charlie', 'David']
})
print(df1)
print(df2)
merged=pd.merge(df1, df2, how="outer", indicator=True, on=["EmployeeID", "Name"])
print(merged)
left_only_df1=merged[merged["_merge"]=="left_only"]
print(left_only_df1)
right_only_df2=merged[merged["_merge"]=="right_only"]
right_only_df2

   EmployeeID     Name
0           1    Alice
1           2      Bob
2           3  Charlie
   EmployeeID     Name
0           2      Bob
1           3  Charlie
2           4    David
   EmployeeID     Name      _merge
0           1    Alice   left_only
1           2      Bob        both
2           3  Charlie        both
3           4    David  right_only
   EmployeeID   Name     _merge
0           1  Alice  left_only

   EmployeeID   Name      _merge
3           4  David  right_only

## TAsk 12

In [25]:
df1 = pd.DataFrame({
    'ID': [1, 2],
    'Name': ['Alice', 'Bob']
})

df2 = pd.DataFrame({
    'ID': [3, 4],
    'Name': ['Charlie', 'David']
})

df3 = pd.DataFrame({
    'ID': [5],
    'Name': ['Eva']
})
pd.concat([df1, df2, df3], ignore_index=True)

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David
4   5      Eva

## TAsk 13

In [28]:
from functools import reduce
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Math': [85, 90, 95]
})

df2 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Science': [80, 88, 93]
})

df3 = pd.DataFrame({
    'ID': [1, 2, 3],
    'English': [78, 85, 92]
})

def merge_all(df_list, how="inner", on="ID"):
    return reduce(lambda left, right: pd.merge(left, right, on=on, how=how), df_list)
merge_all(df_list=[df2, df1, df3])

   ID  Science  Math  English
0   1       80    85       78
1   2       88    90       85
2   3       93    95       92